from pathlib import Path

# ────────────────────────────────────────────────────────────────────────────
# 상수
# ────────────────────────────────────────────────────────────────────────────
KOSPI_RAW_DIR = Path("/opt/airflow/data/KOSPI/unzip")
KOSPI_PARTITION_DIR = Path("/opt/airflow/data/KOSPI/partitioned")
KOSPI_OUT_DIR = Path("/opt/airflow/data/KOSPI/ohlcv")


KOSDAQ_RAW_DIR = Path("/opt/airflow/data/KOSDAQ/unzip")
KOSDAQ_PARTITION_DIR = Path("/opt/airflow/data/KOSDAQ/partitioned")
KOSDAQ_OUT_DIR = Path("/opt/airflow/data/KOSDAQ/ohlcv")
TZ = "Asia/Seoul"

COLS = [
    "일자",
    "대량매매구분코드",
    "정규시간외구분코드",
    "종목코드",
    "종목인덱스",
    "체결번호",
    "체결가격",
    "체결수량",
    "체결유형코드",
    "체결일자",
    "체결시각",
    "근월물체결가격",
    "원월물체결가격",
    "매수회원번호",
    "매수호가유형코드",
    "매수자사주신고서ID",
    "매수자사주매매방법코드",
    "매수매도유형코드",
    "매수위탁자기구분코드",
    "매수위탁사번호",
    "매수PT구분코드",
    "매수투자자구분코드",
    "매수외국인투자자구분코드",
    "매수호가접수번호",
    "매도회원번호",
    "매도호가유형코드",
    "매도자사주신고서ID",
    "매도자사주매매방법코드",
    "매도매도유형코드",
    "매도위탁자기구분코드",
    "매도위탁사번호",
    "매도PT구분코드",
    "매도투자자구분코드",
    "매도외국인투자자구분코드",
    "매도호가접수번호",
    "시가",
    "고가",
    "저가",
    "직전가격",
    "누적체결수량",
    "누적거래대금",
    "최종매도매수구분코드",
    "LP보유수량",
    "데이터구분",
    "메세지일련번호",
    "매수프로그램호가신고구분코드",
    "매도프로그램호가신고구분코드",
    "보드ID",
    "세션ID",
    "실시간상한가",
    "실시간하한가",
]

KEEP = ["종목코드", "체결가격", "체결수량", "체결일자", "체결시각"]
